NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/MGM24/MGM240PA32VNN.svd
        <register>
          <name>CH5_CTRL</name>
          <description>No Description</description>
          <addressOffset>0x154</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFB</resetMask>
          <fields>
            <field>
              <name>STRUCTTYPE</name>
              <description>DMA Structure Type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRANSFER</name>
                  <description>DMA transfer structure type selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCHRONIZE</name>
                  <description>Synchronization structure type selected.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Write immediate value structure type selected.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRUCTREQ</name>
              <description>Structure DMA Transfer Request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XFERCNT</name>
              <description>DMA Unit Data Transfer Count</description>
              <bitOffset>4</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYTESWAP</name>
              <description>Endian Byte Swap</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLOCKSIZE</name>
              <description>Block Transfer Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNIT1</name>
                  <description>One unit transfer per arbitration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNIT2</name>
                  <description>Two unit transfers per arbitration</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNIT3</name>
                  <description>Three unit transfers per arbitration</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNIT4</name>
                  <description>Four unit transfers per arbitration</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNIT6</name>
                  <description>Six unit transfers per arbitration</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNIT8</name>
                  <description>Eight unit transfers per arbitration</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNIT16</name>
                  <description>Sixteen unit transfers per arbitration</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNIT32</name>
                  <description>32 unit transfers per arbitration</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNIT64</name>
                  <description>64 unit transfers per arbitration</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNIT128</name>
                  <description>128 unit transfers per arbitration</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNIT256</name>
                  <description>256 unit transfers per arbitration</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNIT512</name>
                  <description>512 unit transfers per arbitration</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNIT1024</name>
                  <description>1024 unit transfers per arbitration</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>Transfer all units as specified by the XFRCNT field</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DONEIEN</name>
              <description>DMA Operation Done Interrupt Flag Set En</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQMODE</name>
              <description>DMA Request Transfer Mode Select</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCK</name>
                  <description>The LDMA transfers one BLOCKSIZE per transfer request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>One transfer request transfers all units as defined by the XFRCNT field.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECLOOPCNT</name>
              <description>Decrement Loop Count</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IGNORESREQ</name>
              <description>Ignore Sreq</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCINC</name>
              <description>Source Address Increment Size</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Increment source address by one unit data size after each read</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Increment source address by two unit data sizes after each read</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>Increment source address by four unit data sizes after each read</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not increment the source address. In this mode reads are made from a fixed source address, for example reading FIFO.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE</name>
              <description>Unit Data Transfer Size</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYTE</name>
                  <description>Each unit transfer is a byte</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALFWORD</name>
                  <description>Each unit transfer is a half-word</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD</name>
                  <description>Each unit transfer is a word</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSTINC</name>
              <description>Destination Address Increment Size</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Increment destination address by one unit data size after each write</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Increment destination address by two unit data sizes after each write</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>Increment destination address by four unit data sizes after each write</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not increment the destination address. Writes are made to a fixed destination address, for example writing to a FIFO.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRCMODE</name>
              <description>Source Addressing Mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABSOLUTE</name>
                  <description>The SRCADDR field of LDMA_CHx_SRC contains the absolute address of the source data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RELATIVE</name>
                  <description>The SRCADDR field of LDMA_CHx_SRC contains the relative offset of the source data.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSTMODE</name>
              <description>Destination Addressing Mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABSOLUTE</name>
                  <description>The DSTADDR field of LDMA_CHx_DST contains the absolute address of the destination data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RELATIVE</name>
                  <description>The DSTADDR field of LDMA_CHx_DST contains the relative offset of the destination data.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5_SRC</name>
          <description>No Description</description>
          <addressOffset>0x158</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRCADDR</name>
              <description>Source Data Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5_DST</name>
          <description>No Description</description>
          <addressOffset>0x15C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSTADDR</name>
              <description>Destination Data Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5_LINK</name>
          <description>No Description</description>
          <addressOffset>0x160</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINKMODE</name>
              <description>Link Structure Addressing Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABSOLUTE</name>
                  <description>The LINKADDR field of LDMA_CHx_LINK contains the absolute address of the linked descriptor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RELATIVE</name>
                  <description>The LINKADDR field of LDMA_CHx_LINK contains the relative offset of the linked descriptor.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINK</name>
              <description>Link Next Structure</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINKADDR</name>
              <description>Link Structure Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6_CFG</name>
          <description>No Description</description>
          <addressOffset>0x17C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00330000</resetMask>
          <fields>
            <field>
              <name>ARBSLOTS</name>
              <description>Arbitration Slot Number Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>One arbitration slot selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Two arbitration slots selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>Four arbitration slots selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>Eight arbitration slots selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRCINCSIGN</name>
              <description>Source Address Increment Sign</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POSITIVE</name>
                  <description>Increment source address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGATIVE</name>
                  <description>Decrement source address</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSTINCSIGN</name>
              <description>Destination Address Increment Sign</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POSITIVE</name>
                  <description>Increment destination address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGATIVE</name>
                  <description>Decrement destination address</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6_LOOP</name>
          <description>No Description</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>LOOPCNT</name>
              <description>Linked Structure Sequence Loop Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
